{"meta":{"title":"照葫芦画瓢","subtitle":null,"description":"王者毁一生，吃鸡穷三代，天天调样式，必成高富帅！！！","author":"ShSx","url":"http://yoursite.com"},"pages":[{"title":"分类","date":"2018-11-20T15:49:56.000Z","updated":"2018-11-20T15:52:18.674Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2018-11-20T15:46:42.000Z","updated":"2018-11-20T15:49:07.863Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"","date":"2018-11-18T04:26:53.793Z","updated":"2018-11-18T04:26:53.793Z","comments":true,"path":"jianli.html","permalink":"http://yoursite.com/jianli.html","excerpt":"","text":"在线编辑简历模板 - 五百丁简历 文档将实时更新 默认 分享 导出 模块管理 更换模板 风格设置 简历投递 导入简历 我的简历 访问权限 \"公开\" 手机简历 简历评分：0分 想找份好工作？那得好好完善您的简历档案哦~ 模板编号：BG0019 关于简历评分 什么是简历评分？ 简历评分是根据简历的完整度、丰富度、内容质量等多个角度，结合行业标准，综合衡量出的一项代表简历竞争水平的分值。数据追踪表明：简历评分分值越高，在面试求职及后续的职业发展中通常更有优势，易获得更多面试机会及人脉资源。 提高评分的好处？ 留下好的第一印象 收到更多面试邀约 提高求职通过率 如何提高评分？ 一份拥有足够必要信息的简历就可以在投递中收获不错的效果了，但我们的非必选项及贴士都能在一定程度上帮您更好地展示自己的优点及特色，建议您根据自身实际情况参考填写哦！ 隐藏栏目标题 隐藏时间模块 隐藏描述模块 恢复初始样式恢复 删除当前模块删除 开始 结束 2001-2009 2008 一月二月三月四月 五月六月七月八月 九月十月十一月十二月 一月二月三月四月 五月六月七月八月 九月十月十一月十二月 &#xe8f9; 工作经历 2016.7-2017.9 &#xe8f9; 荣誉奖项 图标更换 缩起 缩起 颜色 字体：微软雅黑 宋体 微软雅黑 黑体 隶书 楷体 Arial Times Tahoma 字体大小：14 12 13 14 15 16 17 18 段距： 模块距离： 统一格式 适用于文字格式紊乱的情况 文字 简体繁体 主公，编辑其它简历前，请记得保存当前简历哦！ 取消切换简历 缩起 基本信息必填 求职意向 教育背景 工作经验 实习经验 志愿者经验 项目经历 自我评价 奖项荣誉 个人标签 技能特长 作品展示 二维码 封面 自荐信 添加其它模块 自定义模块 简历访问权限 所有人通过链接地址即可访问 密码访问仅能通过密码访问 确定 仅自己仅自己可以打开简历 缩起 你还没有保存任何简历哦 内容建议 查看实例 教育背景主要包含最基本的在校时间、学校名称、专业、学历，如有社团、班级、学生会等职位也可在简历上呈现，但一定要从具体工作的角度去展开描述，不要在无事实依据的情况下空谈能力，特别是领导力、战略能力，以免贻笑大方。 编辑基本信息 你的姓名 出生日期 选择年月 2014-2022 2008 一月二月三月四月 五月六月七月八月 九月十月十一月十二月 工作年限 选择工作年限 应届生 1年经验 2年经验 3年经验 4年经验 5年经验 6年经验 7年经验 8年经验 9年经验 10年经验 10年以上经验 头像设置 设置头像可见性 显示 隐藏 电话号码 手机号码格式错误，请重新输入 联系邮箱 邮箱格式错误，请重新输入 一句话描述 0/100 自定义字段 所在城市 选择城市 热门城市 安徽 湖南 云南 河北 江苏 吉林 山东 甘肃 福建 广东 湖北 浙江 海南 贵州 辽宁 青海 山西 江西 四川 河南 陕西 广西 宁夏 新疆 西藏 黑龙江 内蒙古 广州 深圳 北京 上海 杭州 成都 西安 南京 厦门 天津 重庆 武汉 香港 澳门 台湾 自定义 合肥 芜湖 蚌埠 淮南 马鞍山 淮北 铜陵 安庆 黄山 滁州 阜阳 宿州 六安 亳州 池州 宣城 长沙 株洲 湘潭 衡阳 邵阳 岳阳 常德 张家界 益阳 郴州 永州 怀化 娄底 湘西土家族苗族自治州 昆明 曲靖 玉溪 保山 昭通 丽江 普洱 临沧 楚雄彝族自治州 红河哈尼族彝族自治州 文山壮族苗族自治州 西双版纳傣族自治州 大理白族自治州 德宏傣族景颇族自治州 怒江傈僳族自治州 迪庆藏族自治州 石家庄 唐山 秦皇岛 邯郸 邢台 保定 张家口 承德 沧州 廊坊 衡水 南京 无锡 徐州 常州 苏州 南通 连云港 淮安 盐城 扬州 镇江 泰州 宿迁 长春 吉林 四平 辽源 通化 白山 松原 白城 延边朝鲜族自治州 济南 青岛 淄博 枣庄 东营 烟台 潍坊 济宁 泰安 威海 日照 莱芜 临沂 德州 聊城 滨州 菏泽 兰州 嘉峪关 金昌 白银 天水 武威 张掖 平凉 酒泉 庆阳 定西 陇南 临夏回族自治州 甘南藏族自治州 福州 厦门 莆田 三明 泉州 漳州 南平 龙岩 宁德 广州 韶关 深圳 珠海 汕头 佛山 江门 湛江 茂名 肇庆 惠州 梅州 汕尾 河源 阳江 清远 东莞 中山 潮州 揭阳 云浮 武汉 黄石 十堰 宜昌 襄阳 鄂州 荆门 孝感 荆州 黄冈 咸宁 随州 恩施土家族苗族自治州 仙桃 潜江 天门 杭州 宁波 温州 嘉兴 湖州 绍兴 金华 衢州 舟山 台州 丽水 海口 三亚 贵阳 六盘水 遵义 安顺 毕节地区 铜仁地区 黔西南布依族苗族自治州 黔东南苗族侗族自治州 黔南布依族苗族自治州 沈阳 大连 鞍山 抚顺 本溪 丹东 锦州 营口 阜新 辽阳 盘锦 铁岭 朝阳 葫芦岛 西宁 海东 海北 黄南 海南 果洛 玉树 海西 太原 大同 阳泉 长治 晋城 朔州 晋中 运城 忻州 临汾 吕梁 南昌 景德镇 萍乡 九江 新余 鹰潭 赣州 吉安 宜春 抚州 上饶 成都 自贡 攀枝花 泸州 德阳 绵阳 广元 遂宁 内江 乐山 南充 眉山 宜宾 广安 达州 雅安 巴中 资阳 阿坝藏族羌族自治州 甘孜藏族自治州 凉山彝族自治州 郑州 开封 洛阳 平顶山 安阳 鹤壁 新乡 焦作 濮阳 许昌 漯河 三门峡 南阳 商丘 信阳 周口 驻马店 济源 西安 铜川 宝鸡 咸阳 渭南 延安 汉中 榆林 安康 商洛 南宁 柳州 桂林 梧州 北海 防城港 钦州 贵港 玉林 百色 贺州 河池 来宾 崇左 银川 石嘴山 吴忠 固原 中卫 乌鲁木齐 克拉玛依 吐鲁番 哈密 昌吉 阿克苏 喀什 和田 伊犁 塔城 阿勒泰 石河子 库尔勒 拉萨 昌都 山南 日喀则 那曲 阿里 林芝 哈尔滨 齐齐哈尔 鸡西 鹤岗 双鸭山 大庆 伊春 佳木斯 七台河 牡丹江 黑河 绥化 大兴安岭地区 呼和浩特 包头 乌海 赤峰 通辽 鄂尔多斯 呼伦贝尔 巴彦淖尔 乌兰察布 兴安盟 锡林郭勒盟 阿拉善盟 展开选填项 以下内容无需全部填写，请选择重要内容展示 你的性别 男 女 最高学历 选择最高学历 初中及以下 高中 中技 中专 大专 本科 硕士 博士 MBA 你的民族 婚姻状况 选择婚姻状况 未婚 已婚 保密 政治面貌 选择政治面貌 中共党员 中共预备党员 共青团员 民主党派人士 无党派民主人士 普通公民 身高/体重 cm Kg 保存 取消 编辑求职意向 意向岗位 意向城市 选择意向城市 热门城市 安徽 湖南 云南 河北 江苏 吉林 山东 甘肃 福建 广东 湖北 浙江 海南 贵州 辽宁 青海 山西 江西 四川 河南 陕西 广西 宁夏 新疆 西藏 黑龙江 内蒙古 广州 深圳 北京 上海 杭州 成都 西安 南京 厦门 天津 重庆 武汉 香港 澳门 台湾 自定义 合肥 芜湖 蚌埠 淮南 马鞍山 淮北 铜陵 安庆 黄山 滁州 阜阳 宿州 六安 亳州 池州 宣城 长沙 株洲 湘潭 衡阳 邵阳 岳阳 常德 张家界 益阳 郴州 永州 怀化 娄底 湘西土家族苗族自治州 昆明 曲靖 玉溪 保山 昭通 丽江 普洱 临沧 楚雄彝族自治州 红河哈尼族彝族自治州 文山壮族苗族自治州 西双版纳傣族自治州 大理白族自治州 德宏傣族景颇族自治州 怒江傈僳族自治州 迪庆藏族自治州 石家庄 唐山 秦皇岛 邯郸 邢台 保定 张家口 承德 沧州 廊坊 衡水 南京 无锡 徐州 常州 苏州 南通 连云港 淮安 盐城 扬州 镇江 泰州 宿迁 长春 吉林 四平 辽源 通化 白山 松原 白城 延边朝鲜族自治州 济南 青岛 淄博 枣庄 东营 烟台 潍坊 济宁 泰安 威海 日照 莱芜 临沂 德州 聊城 滨州 菏泽 兰州 嘉峪关 金昌 白银 天水 武威 张掖 平凉 酒泉 庆阳 定西 陇南 临夏回族自治州 甘南藏族自治州 福州 厦门 莆田 三明 泉州 漳州 南平 龙岩 宁德 广州 韶关 深圳 珠海 汕头 佛山 江门 湛江 茂名 肇庆 惠州 梅州 汕尾 河源 阳江 清远 东莞 中山 潮州 揭阳 云浮 武汉 黄石 十堰 宜昌 襄阳 鄂州 荆门 孝感 荆州 黄冈 咸宁 随州 恩施土家族苗族自治州 仙桃 潜江 天门 杭州 宁波 温州 嘉兴 湖州 绍兴 金华 衢州 舟山 台州 丽水 海口 三亚 贵阳 六盘水 遵义 安顺 毕节地区 铜仁地区 黔西南布依族苗族自治州 黔东南苗族侗族自治州 黔南布依族苗族自治州 沈阳 大连 鞍山 抚顺 本溪 丹东 锦州 营口 阜新 辽阳 盘锦 铁岭 朝阳 葫芦岛 西宁 海东 海北 黄南 海南 果洛 玉树 海西 太原 大同 阳泉 长治 晋城 朔州 晋中 运城 忻州 临汾 吕梁 南昌 景德镇 萍乡 九江 新余 鹰潭 赣州 吉安 宜春 抚州 上饶 成都 自贡 攀枝花 泸州 德阳 绵阳 广元 遂宁 内江 乐山 南充 眉山 宜宾 广安 达州 雅安 巴中 资阳 阿坝藏族羌族自治州 甘孜藏族自治州 凉山彝族自治州 郑州 开封 洛阳 平顶山 安阳 鹤壁 新乡 焦作 濮阳 许昌 漯河 三门峡 南阳 商丘 信阳 周口 驻马店 济源 西安 铜川 宝鸡 咸阳 渭南 延安 汉中 榆林 安康 商洛 南宁 柳州 桂林 梧州 北海 防城港 钦州 贵港 玉林 百色 贺州 河池 来宾 崇左 银川 石嘴山 吴忠 固原 中卫 乌鲁木齐 克拉玛依 吐鲁番 哈密 昌吉 阿克苏 喀什 和田 伊犁 塔城 阿勒泰 石河子 拉萨 昌都 山南 日喀则 那曲 阿里 林芝 哈尔滨 齐齐哈尔 鸡西 鹤岗 双鸭山 大庆 伊春 佳木斯 七台河 牡丹江 黑河 绥化 大兴安岭地区 呼和浩特 包头 乌海 赤峰 通辽 鄂尔多斯 呼伦贝尔 巴彦淖尔 乌兰察布 兴安盟 锡林郭勒盟 阿拉善盟 入职时间 选择入职时间 随时到岗 1周内到岗 1个月内到岗 3个月内到岗 到岗时间另议 不填写 薪资要求 ~ 保存 取消 编辑技能特长 添加 根据您的职业推荐的技能 已添加的技能 （还可以添加10项技能） 保存取消 编辑个人标签 添加 常用标签推荐 已添加的标签 （还可以添加10个标签） 保存取消 编辑作品集 上传图片在线作品 上传图片 请上传jpg、png格式，500K以下图片作品集数量不能超过8个 0/50 www.example.com 这里是作品描述 0/50 保存取消 编辑头像 调整头像尺寸和位置 支持格式：jpg、png,图片大小：1M以内 上传头像 取消保存 编辑超链接 URL 保存取消 确定删除当前子模块吗？ 删除后子模块将无法恢复 不再提醒 确定取消 确定删除当前子模块的描述吗？ 删除后该描述将无法恢复 不再提醒 确定取消 确定删除当前模块吗？ 删除后你可以在右侧模块管理出恢复显示 不再提醒 确定取消 确定创建英文简历吗？ 当前简历我们将自动为你进行保存 确定取消 小丁正在卖力下载中... 已为你自动隐藏不适合在PDF显示的【留言模块】 不再提醒 简历导入 选择简历来源 前程无忧 智联 拉勾 复制已有简历 前程无忧简历导入：（智能解析上传文件，为你省去写简历的时间，仅支持html格式） 上传附件： 选择HTML文件 0% 如何获取前程无忧html格式的简历？ 登录 前程无忧， 进入【我的51Job】-【简历中心】，【预览】想要导出的简历，点击【导出】，选择格式为HTML保存在本地电脑上就可以了。还是不知道如何操作？我要看看详细教程。 导入简历 智联简历导入：（智能解析上传文件，为你省去写简历的时间，仅支持html格式） 上传附件： 选择HTML文件 0% 如何获取智联招聘html格式的简历？ 登录 智联招聘 首页， 进入【简历中心】打开想要导出的简历，找到【更多操作】-【导出】，选择格式为HTML保存在本地电脑上就可以了。还是不知道如何操作？我要看看详细教程。 导入简历 拉勾简历导入：（智能解析上传文件，为你省去写简历的时间，仅支持html格式） 上传附件： 选择HTML文件 0% 如何获取拉勾html格式的简历？ 登录 拉勾网，进入【我的简历】页面，点击【预览简历】，打开预览界面后在底部点击【下载简历 】按钮并选择HTML格式就可以了。还是不知道如何操作？我要看看详细教程。 导入简历 选择需要复制的简历： 您还未创建过简历 0% 此处是复制你在五百丁创建的在线简历，适合需要投递几家公司，内容做小小修改的你。 还是不知道如何操作？我要看看详细教程。 导入简历 简历导入失败 由于你选择的文件与账号不符，请重新导入。 重新导入 简历导入失败 超出最大创建简历数量，请删除部分简历或升级会员后继续 升级会员去删除 简历创建失败 超出最大创建简历数量，请删除部分简历或升级会员后继续 升级会员去删除 简历导入成功 恭喜你的简历导入成功，现在去编辑吧~ 立即编辑 简历导入成功 恭喜你的简历导入成功，请选择一份简历去编辑吧~ 立即编辑 恭喜，你的简历发布成功！ 我们同时为你生成了另外一种形态的档案，点击查看 手机简历 简历命名 亲，给简历起个名字吧 确定取消 请注意，当前处于预览状态，数据不会被保存，请登录后制作登录 诊断ing... 简历智能诊断 您的简历综合评分：80分 真是棒棒哒，但简历内容还可以更充实哦！ 重新诊断 调整中... 封面 &#xe69d; &#xe69d; &#xe69d; 自荐信 &#xe880; 头像 头像风格 &#xe681; 基本信息 &#xe614; &#xe607; &#xe612; &#xe60c; &#xe683; &#xe611;cm &#xe686; &#xe685; &#xe981; &#xe693; &#xe60a; &#xe611;kg &#xf192; 个人主页 &#xe64b; 社交账号 微信 QQ 知乎 微博 钉钉号 &#xe616; 技能特长 +技能特长 &#xe6a7; 个人标签 +个人标签 &#xe8af; 姓名 &#xe680; 求职意向 &#xe613; &#xe96e; &#xe60f; &#xe60d; &#xe60b; &#xe67c; 教育背景 &#xe67d; 工作经验 &#xe60e; 实习经验 &#xe684; 志愿者经历 &#xe697; 项目经验 &#xe682; 荣誉奖项 &#xe67e; 自我评价 &#xe610; 作品展示 +添加作品 &#xe8dd; 二维码 感谢您的阅读，扫一扫查看我的手机简历 if(typeof cvresume != \"undefined\"){ cvresume.main.resume_draw(542,0,5531940,''); cvresume.main.set_language(\"zh\"); cvresume.info.resumecontentid=0;//内容简历模板id cvresume.main.template_set({\"left\":[],\"top\":[{\"key\":\"resume_head\",\"isShow\":true},{\"key\":\"resume_name\",\"isShow\":true},{\"key\":\"base_info\",\"isShow\":true},{\"key\":\"base_home\",\"isShow\":true},{\"key\":\"base_social\",\"isShow\":true}],\"right\":[{\"key\":\"resume_job_preference\",\"isShow\":true},{\"key\":\"resume_edu\",\"isShow\":true},{\"key\":\"resume_work\",\"isShow\":true},{\"key\":\"resume_internship\",\"isShow\":false},{\"key\":\"resume_volunteer\",\"isShow\":false},{\"key\":\"resume_hobby\",\"isShow\":true},{\"key\":\"resume_project\",\"isShow\":false},{\"key\":\"resume_skill\",\"isShow\":true},{\"key\":\"resume_honor\",\"isShow\":false},{\"key\":\"resume_summary\",\"isShow\":true},{\"key\":\"resume_portfolio\",\"isShow\":false},{\"key\":\"resume_recoment\",\"isShow\":false},{\"key\":\"resume_qrcode\",\"isShow\":false}],\"bottom\":[]},0); } // 对应简历模板的个人标签、块距生效js代码（只应用在文档简历） var _mobans_v620 = [\"WM0008\",\"JM0289\",\"MR0031\",\"MR0029\"]; if($.inArray(\"BG0019\", _mobans_v620) != -1){//当前模板块距调节无意义 //隐藏块距功能 $(\"#setStyleModal\").find(\".fgsz-modalmargin\").addClass(\"hidden\"); } 智能诊断 通过AI算法为你的简历进行诊断 诊断 专家点评 各行业资深HR一对一指导简历 咨询 贴士 ● 简历上需要放照片吗？ 此为非必选项，但如果放上去的话请务必让它成为加分项，毕竟这个看脸的世界越来越没有道理可言了，如果翻遍电脑和手机都没有找到一张可以称得上有气质的照片，那还是别放了。 ● 照片有什么标准规范？ 建议使用1-6个月的近期免冠照片，男性请至少干净整洁，不要显得油腻，女生可化淡妆，正常的生活/工作照也可，表情动作大方自然，背景清新简洁的正脸半身照为佳 ● 简历必填的基本信息 姓名/所在城市/电话号码/联系邮箱 &#8730; 姓名 重要信息一定要写清楚，错误示范：张先生/李女士 如果有常用英文名，可以在中文名后面写在括号里，如：李娜（Abby） 没有常用英文名的话，则不建议专门为了工作而取名，否则面试时对方喊你却没有反应，可能会留下负面印象。 &#8730; 所在城市 如目前所处城市跟意向工作城市有出入的话，会影响HR的面试邀约决策，为了提升双方沟通效率，建议填写，如往来意向城市很方便或短期内会搬过去居住，注明即可。 &#8730; 电话号码 建议写成易于拨打的形式，如：185-5555-5555 如果是英文简历，则建议加上区号，如：+86-10-12308 &#8730; 联系邮箱 国内求职推荐使用@163/@sina/@qq等主流邮箱，国外或外企求职推荐使用@gmail等邮箱（qq邮箱很无辜，不要有偏见）； 注意检查邮箱的显示名称，火星文、昵称、出生日期等会显得不够专业，建议使用的“名字”或“名字+当前求职年份”来命名。 （如：lina_Abby@gmail.com，lina2017@163.com） ● 求职意向要注意哪些规范？ 如四大、国有银行等在招聘信息中不分具体职能部门的话，可以不写求职意向。 如需要填写求职意向，则建议一份简历只针对一个意向岗位。 错误示范：过于宽泛 如：意向岗位：客服/行政/行政/后勤/HR 注意：多个意向岗位出现在一份简历中，没有针对性，会给HR一个信息：这个求职者的职业规划十分混乱 推荐写法：精准的职位名称/行业+职位名称 如： 网易游戏_泛娱乐运营策划 人事专员/人力资源相关岗位 食品领域销售类岗位 机械行业商务谈判岗 注意：求职意向是整张简历的核心，千万不要觉得面对不同企业和岗位，改个求职意向就可以海投了，求职意向和简历内容一定要相互呼应，才能最好的展现自己的岗位匹配度。 ● 工作经验的推荐写法？ 2017.04-至今 韩领网络科技（上海）有限公司（Coupang China） Java软件开发工程师 公司简介：Coupang是一家韩国大型的电子商务公司，也是世界上增长最快的电子商务公司。Coupang拥有“韩国亚马逊”之称，其在韩国本土的地位类似中国国内的“京东”。 ● 根据开发进度和任务分配，完成相应模块软件的设计、开发、编程任务； ● 进行程序单元、功能的测试，查出软件存在的缺陷并保证其质量； ● 按计划完成量化的工作要求，并能独立处理和解决所负责的任务。 项目：xxxxxx service 开发技术： RabbitMQ/mysql/Spring/redis(版本一) 开发技术： Kafka/mysql/Spring/redis/multi-thread&concurrency(版本二) 注意：若所在公司较为知名，可对公司规模等信息加以介绍 ● 简历上需要放照片吗？ 此为非必选项，但如果放上去的话请务必让它成为加分项，毕竟这个看脸的世界越来越没有道理可言了，如果翻遍电脑和手机都没有找到一张可以称得上有气质的照片，那还是别放了。 ● 照片有什么标准规范？ 建议使用1-6个月的近期免冠照片，男性请至少干净整洁，不要显得油腻，女生可化淡妆，正常的生活/工作照也可，表情动作大方自然，背景清新简洁的正脸半身照为佳 ● 错误示范 N年前的老照片 卖萌自拍照 旅游风景照 大头贴 多人合影 对方未要求时使用全身照或非正面照 浓妆 卡通形象等非本人照 与本人真实相貌差距过大 ● 必填信息 姓名/所在城市/电话号码/联系邮箱 &#8730; 姓名 重要信息一定要写清楚，错误示范：张先生/李女士 如果有常用英文名，可以在中文名后面写在括号里，如：李娜（Abby） 没有常用英文名的话，则不建议专门为了工作而取名，否则面试时对方喊你却没有反应，可能会留下负面印象。 &#8730; 所在城市 如目前所处城市跟意向工作城市有出入的话，会影响HR的面试邀约决策，为了提升双方沟通效率，建议填写，如往来意向城市很方便或短期内会搬过去居住，注明即可。 &#8730; 电话号码 建议写成易于拨打的形式，如：185-5555-5555 如果是英文简历，则建议加上区号，如：+86-10-12308 &#8730; 联系邮箱 国内求职推荐使用@163/@sina/@qq等主流邮箱，国外或外企求职推荐使用@gmail等邮箱（qq邮箱很无辜，不要有偏见）； 注意检查邮箱的显示名称，火星文、昵称、出生日期等会显得不够专业，建议使用的“名字”或“名字+当前求职年份”来命名。 （如：lina_Abby@gmail.com，lina2017@163.com） ● 一句话描述怎么写？ 用一句话陈述你的求职意向及自身优势，如“8年淘宝运营老鸟”、“10w+微信文章撰写经验” ● 其他字段都必须写么？ 视情况而定，如官方招聘信息中有明确提到相关要求，则建议对相关项如实填写。如：要求工作经验5年；仅限党员；身高不得低于168cm；少数民族优先等。 如职位描述(Job Description)中没有明确要求，则不建议填写多余的基本信息，过多的冗余信息会增加HR阅读简历的负担，给人不专业的感觉。 设计师或技术类人员建议添加个人主页，更好的展示自己。 如： 技术博客：https://pages.github.com/ Github：https://github.com/geek 站酷、UI中国、花瓣等 PS.不要放非本人做的作品，如你只是个打杂的，结果把整个项目都放上去了…少点套路，世界会更美好 ● 填写意向岗位有什么规范？ 如四大、国有银行等在招聘信息中不分具体职能部门的话，可以不写求职意向。 如需要填写求职意向，则建议一份简历只针对一个意向岗位。 错误示范：过于宽泛 如：意向岗位：客服/行政/行政/后勤/HR 注意：多个意向岗位出现在一份简历中，没有针对性，会给HR一个信息：这个求职者的职业规划十分混乱 推荐写法：精准的职位名称/行业+职位名称 如： 网易游戏_泛娱乐运营策划 人事专员/人力资源相关岗位 食品领域销售类岗位 机械行业商务谈判岗 注意：求职意向是整张简历的核心，千万不要觉得面对不同企业和岗位，改个求职意向就可以海投了，求职意向和简历内容一定要相互呼应，才能最好的展现自己的岗位匹配度。 ● 职业类型 毕业了原则上不能再申请实习生的岗位， 实习只有在校生可以申请，有可能转正。 兼职可以是在校生也可以是职场人，是指在不脱离本职工作（或学习）的前提下，利用业余时间从事第二职业，以获得利益。 ● 意向工作城市 若某企业针对同一岗位在多个地区均设有招聘，那么意向城市就一定要写清楚，免得被调岗后又不愿意前往。 写明意向城市也能表明自己在投递简历前对目标企业有了一定了解，且表现了自己强烈的求职意愿。 ● 入职时间 离职前，试用期员工须提前3天告知企业，正式员工则需提前一个月告知，求职者根据自身情况如实填写即可。 面试官会根据岗位的实际用人情况合理参考求职者的到岗时间，相比此项，工作经验更重要。 ● 关于薪资要求 期待薪资多少，怎么回答才好？ 面试时关于薪资问题怎么回答？ ● 教育背景 此项为非必选项，大部分情况下建议填写 注意：工作年限较多或成绩自认不够优异，则可以直接将教育背景清晰罗列后，重点丰富其他模块 必填信息： 教育经历起止日期/学校名称/专业名称/学位 可填信息：成绩排名/主修课程/辅修课程 注意： 尽量简洁，突出重点 成绩优异的话建议写上GPA及排名等信息 主修课程只写与申请岗位相关的即可，相关性强的写在前面 未毕业在校生的教育经历结束日期应填写预计毕业年月 ● GPA怎么算？ 可以参考 College Board 的网站How to Convert Your GPA to a 4.0 Scale，了解美国最权威的机构 College Board（美国大学理事会）是如何换算 GPA 的。 关于GPA的常见说法： 文科/文理学院的 GPA 在 3.6 以上属于比较“高”； 理科/工程学院的 GPA 在 3.2 以上属于比较“高”。 如果GPA不算特别高但在学院内排名很高，可以括号注明，如：GPA:3.2/4.0(1/80) ● 推荐写法 2014.09-2018.06五百丁理工大学电气工程及其自动化（本科） GPA：3.72/4（专业前10%） GRE：324 主修课程：电力系统（暂态、稳态）分析、发电厂变电所电气设备、发电厂电气主系统、电力调度、变电站综合自动化、可编程控制器技术、电力系统规划等。 注意：SAT/ACT/GRE/GMAT/LSAT这类硬性入学考试成绩可列在教育背景处，托福/雅思等语言成绩则建议在其他模块单独描述。 ● 错误示范 2014.09-2018.06五百丁大学金融学（硕士） 主修课程：线性代数、高等数学、微观经济学、宏观经济学、会计学、统计学、财政学、计量经济学、金融学、金融法、保险学、金融工程学、金融经济学、证券投资学、期货与期权、金融数学、风险投资专题、固定收益证券等。 注意：未说明本科学校及专业情况，主修课程中罗列过多课程，且与岗位相关性不强的专业被放在了前面。 ● 工作经验 此项为非必选项，建议填写 可填信息： 工作起止日期/所在公司名称/职位/工作描述（侧重描述自己负责的工作）/工作成果 注意： 工作经验的时间采取倒叙形式，最近经历写在前面； 工作经验的描述与目标岗位的招聘要求尽量匹配，用词精准； 工作成果尽量以数据来呈现，突出个人成果以及做出的贡献； 描述尽量具体简洁。 可对企业进行简短介绍，如：XX行业第二大XX企业，核心产品包括XX / XX行业领军企业，拥有X个分公司和X名员工 / XX领域X轮创业公司，主要产品是XXX，拥有X用户 ● 用数据说话 如： 带领团队/作为核心人员 通过XX 提升X%/节省XX环节XX时间/将销售额提高X%； 通过XX数据分析公司XX问题，提出XX解决方案成功将XX从X提升至X； 带领X名队员/在XX的情况下/迅速找到XX解决方案； 比去年同期提高X%/较同期入职人员高出X倍/比以前团队效率高出X%。 注意：无法用数据表达的成绩说服力较弱，如“获得领导嘉奖/表扬”之类的成绩尽量不要写。 ● 如果不方便透露客户名或项目细节怎么办？ 如果所在行业有严格保密规定（通常投行、咨询、四大等乙方机构都有保护客户隐私的严格规定）可以在简历上大致描述该公司所处行业+项目规模， 如“某保险行业领军企业XX元债券发行”、“某新能源行业集团省级单位系统整体升级”、“某外资整车厂年审项目”等。 ● 在同一公司不同部门工作过怎么写？ 如果时间没有重叠，可以当做两段工作经历来写，不同职位不同部门。 ● 在同一公司相同部门升职过怎么写？ 通常会以最高职位来写，然后如有需要可以在子标题中描述哪一年升过职。 ● 学生工作经验 描述学生工作时应注重凸显与目标岗位招聘要求相匹配的能力，匹配度高的经验挑选2-3条即可； 讲故事+用数据说话：工作内容，做法，做了多少，结果（用数据说话）如实习经验及项目经验已足够证明能力且与目标岗位相匹配，校内学生工作经验可考虑不写。 ● 推荐写法1 2007.04-2011.12五百丁船舶公司经营部经理 ● 管理范围：全面负责公司业务方面的所有工作和本部门20余人的综合管理工作； ● 销售目标：对总经理制定的销售目标负责，实现年国外销售额1.5亿元； ● 市场工作：负责市场情况、竞争者情况的调研，负责展会布置、营销策划、媒体宣传等市场工作； ● 销售工作：负责具体的渠道开发、商务洽谈、客户维护、销售流程的管理； ● 团队管控：负责下属团队20余人的综合管理工作，包含员工培养、任务分解跟踪管理等； ● 其他业绩：开拓了印度孟加拉越南日本荷兰等多个渠道，为此产生了年均1亿多元的销售额； 做好客户维护工作，客户稳定率达90%。 ● 推荐写法2 2017.04-至今韩领网络科技（上海）有限公司（Coupang China）Java软件开发工程师 公司简介：Coupang是一家韩国大型的电子商务公司，也是世界上增长最快的电子商务公司。Coupang拥有“韩国亚马逊”之称，其在韩国本土的地位类似中国国内的“京东”。 ● 根据开发进度和任务分配，完成相应模块软件的设计、开发、编程任务； ● 进行程序单元、功能的测试，查出软件存在的缺陷并保证其质量； ● 按计划完成量化的工作要求，并能独立处理和解决所负责的任务。 项目：xxxxxx service 开发技术： RabbitMQ/mysql/Spring/redis(版本一) 开发技术： Kafka/mysql/Spring/redis/multi-thread&concurrency(版本二) 注意：若所在公司较为知名，可对公司规模等信息加以介绍 ● 学生工作经验示例 2014.9-2016.9校礼仪队/院文艺部副队/队长 工作描述： 1. 主抓院文艺部全面工作，负责整个学院活动的统筹规划，就活动的细则和程序等相关事宜进行沟通等活动的总体安排和联络； 2. 全面负责召集各系文艺部长工作会议，发掘、锻炼和培养文艺骨干； 3. 负责礼仪队员的日常管理、活动培训； 4. 安排校级院级演出活动、校内外各种比赛及颁奖任务； 5. 在学生中大力开展美育活动，提高学生的文艺鉴赏能力。 成果： 迎新周吸引超过50人报名参加礼仪队，负责学校各种晚会走秀、庆典、比赛、会议等，取得校领导及学生的肯定。 ● 实习经验 此项为非必选项，根据实际情况选择 可填信息： 实习起止日期/所在公司名称/职位/工作描述（侧重描述自己负责的工作）/实习成果 注意： 实习经验的时间采取倒叙形式，最近经历写在前面； 实习经验的描述与目标岗位的招聘要求尽量匹配，用词精准； 实习成果尽量以数据来呈现，突出个人成果以及做出的贡献； 描述尽量具体简洁。 ● 推荐写法1 2017.03-2017.05五百丁发展改革委员会行政审批科实习 ● 文案撰写：负责主任交办的各种文字拟稿工作； ● 公文签发：收发有关文件、信函、电报等；办理公文的登记编号、签发、分送工作。催办上级和公司限期办理的事项； ● 会议记录：做好会议记录、整理会议纪要和简报，了解会后的贯彻执行情况； ● 文档管理：整理并打印公司工作报告、总结、规划、计划、决议、通告等，协助主任审核、校对以公司名义签发的公文稿； ● 资料整理：负责公司大事记和有关资料的采集整理工作； ● 文件传阅: 负责公司领导的文件传阅，处理公司领导签批的文件、函电，转递单位和个人给公司领导的请示报告等。 ● 推荐写法2 2017.03-2017.05五百丁发展改革委员会行政审批科实习 S：五百丁自控(Wubaiding Controls)是X国《财富》百强企业之一,创立于18XX年,目前已成长为汽车内饰、设施效益、和动力方案方面的全球领导者。 T：主要作为实习生协助该公司Accounts Payable澳洲部门的财务日常工作事宜。 A： ● 协助财务部门建立并完善企业财务管理体系，对财务部门的日常管理、财务预算、资金运作等各项工作进行控制操作； ● 协助财务部门完成账务处理、内部核算、报表、税务等工作； ● 协助财务部门进行企业成本管理工作，进行成本预测、控制、核算、分析等工作； ● 及时做好会计凭证、账册、报表等财会资料的收集、汇编、归档等会计档案管理工作； ● 完成财务主管安排的其他工作。 R：学习和了解了公司的企业文化和制度流程等，锻炼了自己的独立分析解决问题能力和逻辑思维能力及数据分析能力，增强了团队沟通协作能力和服务意识及工作执行力，积累了实习工作经验。 ● 推荐写法3 2017.04-2017.06五百丁广播电视台新媒体部实习新媒体运营 职责： 1. 自媒体运营负责移动互联网自媒体平台（微信、微博、手机终端为主）的日常运营及推广工作；负责能够独立运营微信公众号，为粉丝策划与提供优质、有高度传播性的内容； 2. 文案撰写：负责策划并执行微信营销线日常活动及跟踪维护，根据项目撰写高质量、具有吸引力及广泛传播性的应用型文章。 3. 市场活动策划：协助市场经理策划市场宣传活动，与媒体沟通宣传的要素，进行品牌的宣传，增强品牌影响力。 业绩 ： 1. 撰写软文发布量达***篇，单篇文章流量平均超过****pv，其中****等 ，更是突破3000uv。专题*****制作数量过百，每月推出一期，平均流量过万。 2. 所负责相关产品微信公众号粉丝数****人，平均文章阅读数1000+，微博粉丝数****人。 ● 项目经验 此项为非必选项，根据实际情况选择 可填信息： 项目名称、项目时间、担任角色、项目描述、业绩成果 注意： 1.内容清晰，结果导向； 2.与目标申请岗位相结合，升华内容； 3.IT项目可包含运行的软硬件环境、开发工具及目标系统等； 4.可参考STAR法则来写： Situation：在什么样的背景下？ Task：面临什么样的目标任务？ Action：针对当时的情况，采用了什么方法？ Result：结果怎样，学习到了什么？ ● 用数据说话 如： 带领团队/作为核心人员 通过XX 提升X%/节省XX环节XX时间/将销售额提高X%； 通过XX数据分析公司XX问题，提出XX解决方案成功将XX从X提升至X； 带领X名队员/在XX的情况下/迅速找到XX解决方案； 比去年同期提高X%/较同期入职人员高出#倍/比以前团队效率高出X%。 注意：无法用数据表达的成绩说服力较弱，如“获得领导嘉奖/表扬”之类的成绩尽量不要写。 ● 如果不方便透露客户名或项目细节怎么办？ 如果所在行业有严格保密规定（通常投行、咨询、四大等乙方机构都有保护客户隐私的严格规定）可以在简历上大致描述该公司所处行业+项目规模， 如“某保险行业领军企业XX元债券发行”、“某新能源行业集团省级单位系统整体升级”、“某外资整车厂年审项目”等。 ● 推荐写法1 2017.02-2017.03五百丁汽车HD10平台ACC、LKA、AEB 展示核心人员 项目描述：此项目为在五百丁大学车辆测试场的一个展示项目，主要展示L2级别的自动驾驶功能整合，可以视为自适应巡航（ACC）、车道保持控制（LKA）和自动紧急制动（AEB）功能的组合。 项目实施：项目采用的平台为陕汽HD10平台牵引式卡车，ACC 和AEB部分传感器为毫米波雷达，LKA 感知部分由公司算法部门承担，单目摄像头+单卡车载电脑完成车道线识别。ACC 算法使用距离误差和速度误差加权得到期望速度，CC中采用二段PID控制器实现加速部分控制，制动与加速之间加入人工deadband以消除期望速度在零附近时的突然制动或加速。LKA 算法采用pure pursuit前馈+横摆角速度误差反馈控制器。 项目成果：整个部分均在车载原型机AD5454上编程完成。 ● 推荐写法2 2014.08-2014.12课程注册系统负责人 项目描述：此项目采用MVC设计模式，MySql数据库， PHP，HTML，CSS的技术上制作的一个动态课程注册系统。 项目职责：担任研发工程师，参与需求调研，项目可行性分析，技术可行性分析和需求分析 ，编写出实现各项功能的完整代码 ，参与软件开发和重大问题解决 ，负责产品的测试与bug跟踪。 项目业绩：实现学生可以通过网站查询并注册现有课程，并可移除已选课程或添加新课程的功能。 ● 错误示范 2016.09-2016.09电影购票系统 使用myeclipse进行编程，同时连接数据库mysql进行数据存储，修改及更新。当时市面上可供参考的文档很少，bug较多，经过不断完善，可以满足系统的日常使用，包括电影院、电影、放映表的增删改查和订单表的查询与删除等功能。之后xx出现且效果不错，便仿照它制作了相应的功能。 注意：内容描述没有条理，难以抓住重点，未能说清自己在项目中的角色及项目，仅客观陈述对应聘毫无帮助。 ● 志愿者经验 此项为非必选项，根据实际情况选择 如果你的工作经验略显单薄，那么志愿者经验则能够帮助你在有限的条件下丰富你的简历，使你距离名企更进一步。志愿者经验不能仅是陈述过程，更重要的是要提炼出自己从中得到了什么成长，为被服务人群做了哪些贡献，体现出你是一个富有爱心，关怀社会，影响社会的人。 现在许多高校会规定学生要至少做40-50小时的社区服务才可以毕业，有些学校甚至要求100+小时的community service，对这些学校的同学来说，志愿者经验的比重及价值也相对更高，尤其对于要申请国外大学的同学，这部分内容一定要认真对待。 ● 什么样的志愿者活动才是出色的志愿者活动呢？ 有的人认为，去不发达地区或不发达国家做支教或其他公益活动比在附近街区进行的支教或志愿活动要好，但其实这种看法是片面的。去那些更远更偏僻的地方虽然听起来更高大上，但和你在附近街区里做的事情都是差不多的。 出色的志愿者活动，是那些你坚持了很长时间，并且你的服务对所服务对象产生了一定影响力的，是有实际意义的志愿活动。 注意：用数据说话。 用数字罗列你志愿者的工作，让HR可以量化你的工作和能力。 如，整理了多少本图书； 做了多少字的整理报告； 连续一年每个周末都会前往XX社区养老院看望X位孤寡老人，为老人们做过……； 每个暑假都会前去XX学校做支教老师，由于当地教育资源比较匮乏，在支教期间坚持帮助学生练习英语口语，回学校后发起募捐，筹得X元，帮助XX学校学生获得了更好的教育资源。 ● 推荐写法 2016.07-2016.09五百丁关爱孤儿志愿者活动活动运营策划助理 项目描述：这是一场和七色花孤儿早期干预项目的家庭一起进行的公益活动，也是一次亲子同理心教育工作坊。 职责描述：参与活动整体策划及运营，与10个家庭进行持续3周的前期沟通；负责现场6家媒体的人员接待工作；活动后整理了X字的总结汇报。 ● 荣誉奖项 此项为非必选项，根据实际情况选择 可填信息： 荣誉证书、竞赛获奖证书、奖学金等 注意： 时间倒叙，与目标岗位相关性强的写在前面 可以用数据来体现奖项的含金量 只写有代表性的奖项即可，同年或同类别的奖项可进行适当合并 ● 推荐写法 2015-2016 获第七届大广赛全国平面一等奖、五百丁大学“创业策划大赛”三等奖 2014-2015 获特等专业奖学金（3/80） 2013-2015 获国家励志奖学金3次 ● 错误示范 2015.04 获三好学生称号 2016.04 获三好学生称号 2015.11 获优秀学生干部称号 2015.12 获文明寝室称号 2016.10 获班级XX摄影比赛三等奖 注意：荣誉奖项倒叙书写，避免简单堆砌，与目标岗位相关性不强或含金量不高的奖项可不写（如班级摄影奖、文明寝室称号等） ● 技能特长 此项为非必选项，根据实际情况选择 可填信息： 行业中需要的技能和各类证书，如 英语技能：CET，托福，雅思，口译证书，专八等行业相关证书等； 专业技能：计算机等级考试证书，JAVA，C++，j2ee，mysql，maven，git，ant等； 个人素质方面的软实力，如：演讲与口才，组织与协调，客户接待，商务谈判等。 注意： 如果目标岗位的招聘信息对技能证书有要求，一定要写。 ● 个人标签 此项为非必选项，根据实际情况选择 有特点、能够体现自身性格及能力与目标岗位相符的个人标签可以写。 ● 作品展示 此项为非必选项，根据实际情况选择 设计师或技术类人员建议添加个人主页，更好的展示自己。 如： 技术博客：https://pages.github.com/ Github：https://github.com/geek 站酷、UI中国、花瓣等 PS.不要放非本人做的作品，如你只是个打杂的，结果把整个项目都放上去了…还是真诚求职比较好 如果你还在探索职业不知道自己想做什么，那么作品集展现广度是很好的选择。但如果你已经确定了求职方向，那么作品集的内容一定要专业专业再专业，不相关的作品可以忽略不展示。 ● 作品集中可添加案例研究 在作品集中加入案例研究，因为单纯视觉效果很棒的作品并不能告诉面试官你能否解决问题。应该谈谈你的设计过程——尝试过什么解决方案，如何尝试的，弃用的方案及原因是什么？ 展示你解决问题的能力就能显示出你值得被雇佣的价值。 ● 自我评价 此项为非必选项，根据实际情况选择 篇幅不要太长，注意结合简历整体的美观度，如果真的有很多话要说，建议以求职信的形式附上。 （求职信是求职者向目标用人单位或单位领导人介绍自己的实际才能、表达自己就业愿望的一种书信，是简历之外的加分项，通常与简历一起投递。） 注意： 自我评价应做到突出自身符合目标岗位要求的“卖点”； 避免过多使用形容词，而应该通过数据及实例来对自身价值进行深化。 ● 推荐写法1 首先，解释一下自己为什么要来应聘这个职位，表示自己的强烈意愿； 然后，阐明一下你能为这家企业创造哪些价值； 最后，总结一下自己在过往工作中做了什么，用数据简略地展示自己的成绩，强调自己的工作能力。 ● 推荐写法2 ● 七年以上网络运维工作及管理经验，项目实操经验丰富，在运维管理和推动方面极具优势； ● 精通计算机网络建设与开发，熟练网络安全技术、路由器、交换机等配置； ● 熟悉主流应用系统的管理、运维、故障处理、容错、备份，负载均衡等技术； ● 对网络安全体系有深入理解，有网络安全事件的紧急处置经验和能力，对国家企业信息化建设有较深认识； ● 思想独立，独立解决问题能力强，能快速适应新的工作学习和生活环境，个人学习能力强； ● 性格开朗，善于沟通，有较强的组织及协调能力，具有很强的抗压能力，工作中可以独挡一面。 ● 推荐写法3 ● 在校有两年独立项目实战经验，培养了较强的独立分析及解决问题的能力，养成了良好而规范的编程习惯，在团队协作中建立起了良好的团队沟通协作能力及服务意识，逻辑思维缜密，执行力及抗压能力强。 ● 在GITHUB有一个高STAR的开源项目。熟悉web开发，熟炼使用springmvc、hessian、redis、RocketMq中间件等，熟悉jvm、多线程、rpc等，熟练使用maven、git，熟悉并能熟练使用Linux操作系统，熟练使用jQuery框架，曾经开发过jQuery插件，了解XX行业的相关知识。 ● 我乐观开朗，踏实努力， 善于有效沟通与团队合作，能够合理规划时间与协作分工，必要时能够发挥领导和决策，能够同时注重细节并顾及整体，具有应对解决随机问题的能力，是被公认的高效率可信赖的伙伴。 ● 我十分认同贵公司学习可以改变命运的历练，正是不断的学习才能使我在自己所热爱的的职业上的专业能力能够不断提升，使自己能够持续前进，如果能够加入贵公司，对我来说将是另一段学习的开始，希望能和公司一起成长。 ● 封面 此项为非必选项 简历封面应突出本人的基本信息尤其是联系方式。 作为外在形式，简历封面一定程度上可以折射出求职者的素养与喜好，建议设计类人员选择使用或自行设计。 ● 自荐信 此项为非必选项 自荐信是求职者向目标用人单位或单位领导人介绍自己的实际才能、表达自己就业愿望的一种书信，是简历之外的加分项，通常与简历一起投递。是申请人通过阐述申请动机、描述相关经历来说服HR提供面试机会的途径。 自荐信(cover letter)在面对外企求职时显得尤为重要，长度通常在200-400字左右。 结合目标岗位的招聘信息，用言简意赅的语句阐述清楚以下内容即可： 1.感兴趣的目标岗位 2.相关工作经历及相关能力 3.为什么申请该职位 4.为什么申请该公司 案例 更多案例>> 五百丁理工大学电气工程及其自动化（本科） GPA：3.72/4（专业前10%） GRE：324 主修课程：电力系统（暂态、稳态）分析、发电厂变电所电气设备、发电厂电气主系统、电力调度、变电站综合自动化、可编程控制器技术、电力系统规划等。 注意：SAT/ACT/GRE/GMAT/LSAT这类硬性入学考试成绩可列在教育背景处，托福/雅思等语言成绩则建议在其他模块单独描述。 应用此案例 五百丁科技公司Java软件开发工程师 根据开发进度和任务分配，完成相应模块软件的设计、开发、编程任务； 进行程序单元、功能的测试，查出软件存在的缺陷并保证其质量； 按计划完成量化的工作要求，并能独立处理和解决所负责的任务。 应用此案例 五百丁金融信息服务公司产品专员 ● 负责APP产品的需求分析、需求整理、产品功能设计和业务流程设计。 ● 负责和设计、开发团队配合，推动项目进度及产品上线前的测试验收工作。 ● 收集用户反馈，促进产品迭代优化。 成果描述：熟悉了互联网产品交互设计流程，提高了开发及项目管理能力，提高了团队组织和协调能力，合作共事交流能力增强。 应用此案例 五百丁网络科技公司课程注册系统负责人 项目描述：此项目采用MVC设计模式，MySql数据库， PHP，HTML，CSS的技术上制作的一个动态课程注册系统。 项目职责：担任研发工程师，参与需求调研，项目可行性分析，技术可行性分析和需求分析 ，编写出实现各项功能的完整代码 ，参与软件开发和重大问题解决 ，负责产品的测试与bug跟踪。 项目业绩：实现学生可以通过网站查询并注册现有课程，并可移除已选课程或添加新课程的功能。 应用此案例 五百丁子商务有限公司UI设计师 2006年所带高二（4）班获校“精神文明班级”； 2008年 参与《教材全析》撰稿； 2009年所带高三（2）班团支部荣获当年五四红旗团支部荣誉称号； 2010年所带高三（1）班荣获校“精神文明班级”； 2010年《高中英语实验班》撰稿； 2009年、2012年、2015年 参加广东省普通高考评卷工作。 应用此案例"}],"posts":[{"title":"如何基于hexo搭建博客","slug":"如何基于hexo搭建博客","date":"2018-11-21T04:51:00.000Z","updated":"2018-11-21T05:10:58.470Z","comments":true,"path":"2018/11/21/如何基于hexo搭建博客/","link":"","permalink":"http://yoursite.com/2018/11/21/如何基于hexo搭建博客/","excerpt":"","text":"前言：基于hexo建站百度已有类似很多文章，我就不重复画瓢了。不买服务器的话推荐gitee作为服务器托管。亲测gitee比github快10倍！！！ hexo相关官方网站我使用的hexo+gitee+next（主题） hexo：https://hexo.io/zh-cn/docs/ NexT（hexo主题）：https://theme-next.iissnan.com/ 如有问题请加QQ群：793379854（计算机课设不会做）","categories":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/categories/hexo/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"}]},{"title":"搭建hexo遇到的问题","slug":"搭建hexo遇到的问题","date":"2018-11-21T01:19:18.000Z","updated":"2018-11-21T02:04:58.971Z","comments":true,"path":"2018/11/21/搭建hexo遇到的问题/","link":"","permalink":"http://yoursite.com/2018/11/21/搭建hexo遇到的问题/","excerpt":"","text":"如何引用自己的文章12&#123;% post_link 文章文件名（不要后缀） 文章标题（可选） %&#125;例：&#123;% post_link 关于ShSx-G的由来 ShSx.G %&#125; 发布的图片太大（1M的图片在githubpage中卡的不能看）12我的解决方案是将图片压缩，我的用的一个在线压缩图片的网址是：https://tinypng.com/亲测1M的可以压到200k，图片清晰度还可以 nginx作为hexo的服务器访问503因为没有文件的访问权限测试nginx配置文件123[root@iz2ze88p52tbioqel09nmrz ~]# nginx -tnginx: the configuration file /etc/nginx/nginx.conf syntax is oknginx: configuration file /etc/nginx/nginx.conf test is successful 打开nginx.conf ,修改user nginx 为user root，然后重新载入配置文件命令：nginx -s reload12345678# For more information on configuration, see:# * Official English Documentation: http://nginx.org/en/docs/# * Official Russian Documentation: http://nginx.org/ru/docs/user root;worker_processes auto;error_log /var/log/nginx/error.log;pid /run/nginx.pid; nginx其他常用命令1234nginx # 启动 Nginxnginx -s reload # 重新载入配置文件nginx -s reopen # 重启 Nginxnginx -s stop # 停止 Nginx","categories":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/categories/hexo/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"}]},{"title":"关于ShSx.G的由来","slug":"关于ShSx-G的由来","date":"2018-11-19T15:06:58.000Z","updated":"2018-11-21T05:14:01.531Z","comments":true,"path":"2018/11/19/关于ShSx-G的由来/","link":"","permalink":"http://yoursite.com/2018/11/19/关于ShSx-G的由来/","excerpt":"","text":"ShSx.G是我为我自己起的一个英文名字，鉴于我的英文知识比较匮乏，我也不知道这么拼写到底合不合法，反正都是英文字母和英文标点符号，应该没有什么大问题。 G的由来 我姓高，取高的拼音首字母G ShSx的由来来源于四大名著的拼音首字母，《三国演义》（S），《红楼梦》（H），《水浒传》（S），《西游记》（X）。忽略大小写，排名分先后，代表了四大名著在我心中的位置。 三国演义 此桥段是皇叔一言不慎，差点被砍死的截图。论：少说话，多做事的重要性 皇叔：我X，我刚才说了什么？ 刘表：这小子说谁呢？？","categories":[{"name":"about","slug":"about","permalink":"http://yoursite.com/categories/about/"}],"tags":[{"name":"ShSx.G","slug":"ShSx-G","permalink":"http://yoursite.com/tags/ShSx-G/"}]},{"title":"About Me","slug":"about","date":"2018-11-18T04:28:05.000Z","updated":"2018-11-21T04:42:44.542Z","comments":true,"path":"2018/11/18/about/","link":"","permalink":"http://yoursite.com/2018/11/18/about/","excerpt":"","text":"个人简介 我是 ShSx.G （主要是看大家都有），javaer，现在居住在北京，未来想去杭州发展。鉴于我的英文名字不好拼，拼出来也不好听，所以还是不要叫我的英文名字了。由于我擅长画瓢，可以叫我小瓢（^_^）！！！如果用一个词形容自己的话，我觉得是：善良。 教育背景 毕业院校 专业 时间 学历 兰州理工大学 软件工程 2013-9至2017-6 本科 工作经历 工作单位 职位 时间 用友 软件开发实习生 2016-12至2017-5 用友 软件开发工程师 2017-6至今 我会什么 前端：可以使用react写些简单的组件，对前端模块化，nodejs，npm，webpack，babel有一定的了解 后端：能够快速的使用spring+springmvc+mybatis（hibernate）搭建一个简单的web后端系统 运维：了解或使用过相关工具，jekins，docker，git，nignx，linux，maven 中间件：工作中使用的有redis，dubbo，自己也有了解过mq，memcache等 我做过什么 目前维护公司的ToB的审批流平台，与审批流相关的业务还算了解 工作中做过eclipse插件，以帮助公司的其他项目快速开发 使用java写了一个类似于有道词典的划屏取词的工具 使用Hexo+nignx+git搭建个人博客 我的希望 目前想在杭州找一份java开发的相关工作，如果有合适的岗位，可以给我发一份邮件，或者打电话聊聊，非常感谢(^_^)！我的邮箱：1183782035@qq.com我的电话：13401002587","categories":[{"name":"about","slug":"about","permalink":"http://yoursite.com/categories/about/"}],"tags":[{"name":"about","slug":"about","permalink":"http://yoursite.com/tags/about/"}]},{"title":"linux之ln的用法","slug":"linux之ln的用法","date":"2018-11-12T13:07:00.000Z","updated":"2018-11-20T16:07:28.197Z","comments":true,"path":"2018/11/12/linux之ln的用法/","link":"","permalink":"http://yoursite.com/2018/11/12/linux之ln的用法/","excerpt":"","text":"1、软链接就是：ln –s 源文件 目标文件，只会在选定的位置上生成一个文件的镜像，不会占用磁盘空间，类似与windows的快捷方式。 2、硬链接ln源文件目标文件，没有参数-s，会在选定的位置上生成一个和源文件大小相同的文件，无论是软链接还是硬链接，文件都保持同步变化。 例： ①ln -s /usr/software/nodejs/bin/npm /usr/local/bin/ ②ln -s /usr/software/nodejs/bin/node /usr/local/bin/","categories":[{"name":"linux","slug":"linux","permalink":"http://yoursite.com/categories/linux/"}],"tags":[{"name":"linux","slug":"linux","permalink":"http://yoursite.com/tags/linux/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-11-08T11:05:57.914Z","updated":"2018-11-20T16:08:39.598Z","comments":true,"path":"2018/11/08/hello-world/","link":"","permalink":"http://yoursite.com/2018/11/08/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"hello","slug":"hello","permalink":"http://yoursite.com/categories/hello/"}],"tags":[]},{"title":"2018年1月3日-学习日志","slug":"2018年1月3日-学习日志","date":"2018-01-03T11:56:27.000Z","updated":"2018-11-21T12:49:53.697Z","comments":true,"path":"2018/01/03/2018年1月3日-学习日志/","link":"","permalink":"http://yoursite.com/2018/01/03/2018年1月3日-学习日志/","excerpt":"","text":"余尝曰：读《金瓶梅》而生怜悯心者，菩萨也；生畏惧心者，君子也；生欢喜心者，小人也；生效法心者，乃禽兽耳。 Sql优化之in与join的爱恨情仇流程设计相关流程查询原sql:12345SELECT * FROM `icop-bpm`.`act_re_model` m WHERE m.deployment_id_ IN (SELECT p.deployment_id_ FROM act_re_procdef p WHERE p.key_ IN( SELECT c.`prodefkey` FROM `bpm_billconfig` c WHERE c.`orgid` IN ('first0001company') AND c.`iscontainsub`=1 UNION SELECT c.`prodefkey` FROM `bpm_billconfig` c INNER JOIN `bpm_billconfig_org` g ON g.`configid` = c.`id` AND g.`orgid` ='8a83898e56f96bc6015703ab3032002b' WHERE c.`orgid` IN ('first0001company') AND (c.`iscontainsub` IS NULL OR c.`iscontainsub`=0))) AND name_ LIKE '%%' ORDER BY CONVERT( name_ USING GBK); 耗时:2.365sec优化后sql:1234SELECT * FROM `icop-bpm`.`act_re_model` m WHERE m.deployment_id_ IN( SELECT p.deployment_id_ FROM act_re_procdef p INNER JOIN (SELECT c.`prodefkey` AS prodefkey FROM `bpm_billconfig` c WHERE c.`orgid` IN ('first0001company') AND c.`iscontainsub`=1 UNION SELECT c.`prodefkey` AS prodefkey FROM `bpm_billconfig` c INNER JOIN `bpm_billconfig_org` g ON g.`configid` = c.`id` AND g.`orgid` ='8a83898e56f96bc6015703ab3032002b' WHERE c.`orgid` IN ('first0001company') AND (c.`iscontainsub` IS NULL OR c.`iscontainsub`=0)) g ON g.prodefkey=p.`KEY_`) AND name_ LIKE '%%' ORDER BY CONVERT( name_ USING GBK); 耗时:0.045sec总结:将流程部署表根据key的in查询修改为inner join 查询. java时间转换成毫秒值123456789101112private SimpleDateFormat dateformat;private long time;private long getMills()&#123; dateformat = new SimpleDateFormat(\"yyyy-MM-dd HH:mm:ss\"); //时间格式 try &#123; time = dateformat.parse(\"1971-01-01 00:00:00\").getTime();//格式转换 System.out.println(time); &#125; catch (java.text.ParseException e) &#123; e.printStackTrace(); &#125; return time;&#125; Js Date 对象原型添加格式化// 对Date的扩展，将 Date 转化为指定格式的String// 月(M)、日(d)、小时(h)、分(m)、秒(s)、季度(q) 可以用 1-2 个占位符，// 年(y)可以用 1-4 个占位符，毫秒(S)只能用 1 个占位符(是 1-3 位的数字)// 例子：// (new Date()).Format(“yyyy-MM-dd hh:mm:ss.S”) ==&gt; 2006-07-02 08:09:04.423// (new Date()).Format(“yyyy-M-d h:m:s.S”) ==&gt; 2006-7-2 8:9:4.18123456789101112131415Date.prototype.Format = function (fmt) &#123; //author: nature var o = &#123; \"M+\": this.getMonth() + 1, //月份 \"d+\": this.getDate(), //日 \"h+\": this.getHours(), //小时 \"m+\": this.getMinutes(), //分 \"s+\": this.getSeconds(), //秒 \"q+\": Math.floor((this.getMonth() + 3) / 3), //季度 \"S\": this.getMilliseconds() //毫秒 &#125;; if (/(y+)/.test(fmt)) fmt = fmt.replace(RegExp.$1, (this.getFullYear() + \"\").substr(4 - RegExp.$1.length)); for (var k in o) if (new RegExp(\"(\" + k + \")\").test(fmt)) fmt = fmt.replace(RegExp.$1, (RegExp.$1.length == 1) ? (o[k]) : ((\"00\" + o[k]).substr((\"\" + o[k]).length))); return fmt;&#125; Springmvc @PathVariable()注解用法通过@ PathVariable注解获取的参数如果有小数点，会自动过滤掉小数点和小数点后面的字符，两种方法可以解决，第一种：1、问题SpringMVC项目中通过下面的ＵＲＬ进行GET请求。当version有多个小数点的时候。如version为1.0.1008。后台通过@PathVariable来获取version等于1.0。会丢失部分数据。URL:http://host_ip/consumer/appVersion/phone/android/download/{version}Controller:1234@RequestMapping(value=\"android/download/&#123;version&#125;\",method=RequestMethod.GET)public void download(HttpSession session,HttpServletResponse response,@PathVariable(\"version\")String version)&#123;&#125; 2、解决方案在version段后增加一个静态的字符段，这个段没有任何意义，可以为任意字符。URL:http://host_ip/consumer/appVersion/phone/android/download/{version}/static_str问题虽然解决了，但毕竟URL后多了个小尾巴，心情不愉悦。再次谷哥。参考：http://stackoverflow.com/questions/3526523/spring-mvc-pathvariable-getting-truncatedURL不加小尾巴。在@RequestMapping的value中使用SpEL来表示，value中的{version}换成{version:.+}。1234@RequestMapping(value=\"android/download/&#123;version:.+&#125;\",method=RequestMethod.GET)public void download(HttpSession session,HttpServletResponse response,@PathVariable(\"version\")String version)&#123;&#125; Mysql在windows上的安装Mysql windows上的安装分为两种：第一种是msi安装，该安装时直接下一步就行，如果以前安装过，在安装过程出现问题，记得删除注册表。第二种是免安装的，解压压缩文件包，但是需对my.ini文件进行配置，basedir和datadir是必须的，（1） 以管理员身份运行cmd，进入到bin目录下（2） 复制一个my-default.ini,名称为my.ini,配置basedir路径和datadir路径（3） 安装：执行 mysqld install, 正确的提示语为Service successfully installed.（4） 启动：net start mysql 启动成功：MySQL 服务已经启动成功。 Npm命令npm install 报错今天遇到一个问题，在npm install 的时候报错，我以为是远程库的问题，换了淘宝镜像之后还是不行最后在该路径下打印报错信息：D:\\Program Files\\nodejs\\node_modules\\npm\\node_modules\\pacote\\node_modules\\make-fetch-happen\\node_modules\\node-fetch-npm\\node_modules\\json-parse-better-errorsIndex.js文件1234try &#123; return JSON.parse(txt, reviver) &#125; catch (e) &#123;console.log(&quot;error message：&quot;+txt); 后来发现是缓存的问题：执行给命令：清理缓存1npm cache clean –force 然后在 npm install","categories":[],"tags":[]},{"title":"2017年12月28日-学习日志","slug":"2017年12月28日-学习日志","date":"2017-12-28T12:59:03.000Z","updated":"2018-11-21T13:08:26.468Z","comments":true,"path":"2017/12/28/2017年12月28日-学习日志/","link":"","permalink":"http://yoursite.com/2017/12/28/2017年12月28日-学习日志/","excerpt":"","text":"时间是不会等待的，无论发生什么事，它都会一如既往的向前走。 如何配置SLF4J不同的日志实现最近使用在学习shiro，在网上找了一个demo，在test的时候总是报错但是test是通过的百度知道上看到一篇很好的回答：使用slf4j库作为你的Java应用日志API层有很多好处，这里我会展示一小部分关于如何使用和配置它的例子。你可以把slf4j想成一个Java的接口，然后你需要实现这个接口，从而在运行时提供实际的日志记录，例如把日志写到控制台(STDOUT)或者一个文件上等等。每种实现（或成为绑定）都显而易见地有他们自己的方式来配置日志的输出，但是你的应用对实现者并无感知并且一直使用相同的org.slf4j.Logger API。让我们看看如何在实际中使用它。使用slf4j做简单的日志记录创建基于Maven的工程，在pom.xml中添加如下内容12345&lt;dependency&gt; &lt;groupId&gt;org.slf4j&lt;/groupId&gt; &lt;artifactId&gt;slf4j-api&lt;/artifactId&gt; &lt;version&gt;1.7.5&lt;/version&gt;&lt;/dependency&gt; 现在你可以在你的Java代码中这样使用Logger1234567891011121314package deng;import org.slf4j.*;public class Hello &#123; static Logger LOGGER = LoggerFactory.getLogger(Hello.class); public static void main(String[] args) &#123; for (int i = 0; i &lt; 10; i++) if (i % 2 == 0) LOGGER.info(&quot;Hello &#123;&#125;&quot;, i); else LOGGER.debug(&quot;I am on index &#123;&#125;&quot;, i); &#125;&#125; 以上代码可以编译通过，但是当你运行它时，你会看到这样的输出1234bash&gt; java deng.HelloSLF4J: Failed to load class &quot;org.slf4j.impl.StaticLoggerBinder&quot;.SLF4J: Defaulting to no-operation (NOP) logger implementationSLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details. 上面的意思是，在运行时，你没有做日志的实现（或者说日志的绑定），所以slf4j简简单单的使用了一个什么也不会做的空实现。为了看到正确的输出，你应该尝试使用一个简单（simple）的实现，这个实现根本不需要任何配置！只要回到pom.xml然后添加如下配置12345&lt;dependency&gt; &lt;groupId&gt;org.slf4j&lt;/groupId&gt; &lt;artifactId&gt;slf4j-simple&lt;/artifactId&gt; &lt;version&gt;1.7.5&lt;/version&gt;&lt;/dependency&gt; 现在你可以在控制台(STDOUT)看见INFO级别的日志输出了。这个简单的logger会默认显示任何INFO或者更高级别的信息。想要看DEBUG级别的信息，你需要在Java启动时传入这个系统属性(system property)-Dorg.slf4j.simpleLogger.defaultLogLevel=DEBUG使用slf4j与Log4j日志现在我们可以试验并更换不同的日志实现，但你的程序代码可以保持不变。我们要做的是用另一个流行的日志实现来替换掉slf4j-simple，比如Log4j。12345&lt;dependency&gt; &lt;groupId&gt;org.slf4j&lt;/groupId&gt; &lt;artifactId&gt;slf4j-log4j12&lt;/artifactId&gt; &lt;version&gt;1.7.5&lt;/version&gt;&lt;/dependency&gt; 又一次，我们必须对我们选的每一个日志实现做配置。在这个例子中，我们需要一个文件src/main/resources/log4j.properties。12345log4j.rootLogger=DEBUG, STDOUTlog4j.logger.deng=INFOlog4j.appender.STDOUT=org.apache.log4j.ConsoleAppenderlog4j.appender.STDOUT.layout=org.apache.log4j.PatternLayoutlog4j.appender.STDOUT.layout.ConversionPattern=%5p [%t] (%F:%L) - %m%n 重运行你的程序，你会看到同样的输出结果。使用slf4j和JDK日志JDK实际上带有一个日志包，你可以在pom.xml中替换为另一个日志实现。12345&lt;dependency&gt; &lt;groupId&gt;org.slf4j&lt;/groupId&gt; &lt;artifactId&gt;slf4j-jdk14&lt;/artifactId&gt; &lt;version&gt;1.7.5&lt;/version&gt;&lt;/dependency&gt; 现在JDK日志的配置起来有一点困难。这里不仅需要一个配置文件src/main/resources/logging.properties，你还需要添加一个系统属性-Djava.util.logging.config.file=logging.properties这是一个logging.properties的示例1234level=INFOhandlers=java.util.logging.ConsoleHandlerjava.util.logging.ConsoleHandler.level=FINESTdeng.level=FINEST 使用slf4j和Logback日志Logback日志实现是一个高质量的实现。如果你想在项目中写认真的代码，你会想要考虑这中方式。还是修改你的pom.xml文件，替换成这样12345&lt;dependency&gt; &lt;groupId&gt;ch.qos.logback&lt;/groupId&gt; &lt;artifactId&gt;logback-classic&lt;/artifactId&gt; &lt;version&gt;1.0.13&lt;/version&gt;&lt;/dependency&gt; 这是一个简单的配置src/main/resources/logback.xml12345678910111213&lt;configuration&gt; &lt;appender name=&quot;STDOUT&quot; class=&quot;ch.qos.logback.core.ConsoleAppender&quot;&gt; &lt;encoder&gt; &lt;pattern&gt;%d&#123;HH:mm:ss.SSS&#125; [%thread] %-5level %logger&#123;36&#125; - %msg%n&lt;/pattern&gt; &lt;/encoder&gt; &lt;/appender&gt; &lt;logger name=&quot;deng&quot; level=&quot;DEBUG&quot;/&gt; &lt;root level=&quot;INFO&quot;&gt; &lt;appender-ref ref=&quot;STDOUT&quot; /&gt; &lt;/root&gt;&lt;/configuration&gt; 用slf4j写你自己的日志库如果你正在很多终端用户(END USER)提供Java库，那么让你的项目仅依赖slf4j-api绝对是个好想法，然后让你的用户在他们开发和运营环境中选择任意的日志实现。作为终端用户，他们可以快速地从上面提到的日志库中选择一个，并且从他们自己喜欢的日志实现的特性中受益。slf4j log4j logback之间的关系，哪个更好些SLF4J(The Simple Logging Facade for Java)官方文档是这样说明的 The Simple Logging Facade for Java (SLF4J) serves as a simple facade or abstraction for various logging frameworks, such as java.util.logging, logback and log4j. SLF4J allows the end-user to plug in the desired logging framework at deployment time. Note that SLF4J-enabling your library/application implies the addition of only a single mandatory dependency, namely slf4j-api-1.7.22.jar. 简答的讲就是slf4j是一系列的日志接口，而log4j logback是具体实现了的日志框架。 因为是接口，所以在项目中如果你不引用log4j 、logback或者其它日志框架你会发现，控制台的输出是这样的 从运行结果可以看到，由于没有给出具体的logger实现，无法在控制台输出日志。也就是说我们在具体开发中，需要绑定一个日志框架，才能正常的使用slf4j。 log4j和logback呢而log4j和logback就是两个受欢迎的日志框架。但两者又有不同。• log4j是apache实现的一个开源日志组件。（Wrapped implementations）• logback同样是由log4j的作者设计完成的，拥有更好的特性，用来取代log4j的一个日志框架。是slf4j的原生实现。（Native implementations） 接下来一起看一下应用程序对日志框架的调用关系，看下图 可以看到logback是直接实现了slf4j的接口，而log4j不是对slf4j的原生实现，所以slf4j api在调用log4j时需要一个适配层。 官方文档对logback是这样说的: Native implementation There are also SLF4J bindings external to the SLF4J project, e.g.logback which implements SLF4J natively. Logback’sch.qos.logback.classic.Logger class is a direct implementation of SLF4J’sorg.slf4j.Logger interface.Thus, using SLF4J in conjunction with logback involves strictly zero memory and computational overhead. 也就是说logback实现slf4j是不消耗内存和计算开销的。 最后总结一下： slf4j是java的一个日志门面，实现了日志框架一些通用的api，log4j和logback是具体的日志框架。 他们可以单独的使用，也可以绑定slf4j一起使用。• 单独使用。分别调用框架自己的方法来输出日志信息。• 绑定slf4j一起使用。调用slf4j的api来输入日志信息，具体使用与底层日志框架无关（需要底层框架的配置文件）显然这里我们不推荐单独使用日志框架。假设项目中已经使用了log4j，而我们此时加载了一个类库，而这个类库依赖另一个日志框架。这个时候我们就需要维护两个日志框架，这是一个非常麻烦的事情。而使用了slf4j就不同了，由于应用调用的抽象层的api，与底层日志框架是无关的，因此可以任意更换日志框架。解密Log4j、SLF4J、Common-logging的区别前面有一篇日志中简单的介绍了 log4j，同时也介绍了它与commons-logging的关系，但是突然冒出来一个slf4j，并且slf4j有取代commons-logging的趋势，所以，我们可以推知slf4j与commons-logging的作用应该相差不大的。 好，下面开始先讲讲slf4j。1.slf4j他只提供一个核心slf4j api(就是slf4j-api.jar包)，这个包只有日志的接口，并没有实现，所以如果要使用就得再给它提供一个实现了些接口的日志包，比 如：log4j,common logging,jdk log日志实现包等，但是这些日志实现又不能通过接口直接调用，实现上他们根本就和slf4j-api不一致，因此slf4j又增加了一层来转换各日志实 现包的使用，当然slf4j-simple除外。 slf4j+log4j组合使用模式： slf4j-api-1.5.11.jar slf4j-log4j12-1.5.11.jar log4j-1.2.15.jar log4j.properties(也可以是 log4j.xml) JCL+Log4J组合使用模式（即commons-logging+log4j）： commons-logging-1.1.jar log4j-1.2.15.jar log4j.properties 2.不同的获取logger的方式log4j：12import org.apache.log4j.Logger;Logger logger= Logger.getLogger(xx.class); slf4j+log4j：123import org.slf4j.Logger;import org.slf4j.LoggerFactory;Logger logger = LoggerFactory.getLogger(xx.class); jcl+log4j:123import org.apache.commons.logging.Log; import org.apache.commons.logging.LogFactory;private static Log log = LogFactory.getLog(xx.class); 注意：common-longing是默认支持log4j的，使用其他日志工具需要做下面的配置：common-logging.properties org.apache.commons.logging.Log=org.apache.commons.logging.impl.Log4JCategoryLog 3.总结 总的来说，slf4j与commons-logging只是一个日志门面，实际还是要依赖真正的日志库log4j，虽然slf4j和commons-loggins自带了日志库，但是毕竟log4j才是最强大的。因为以前没有博客，我都是将自己喜欢的内容粘贴到word文档中，这是从以前word导入过来的内容，原url找不到了，不是原创，感谢开源，感谢分享，侵删！","categories":[],"tags":[]},{"title":"2017年12月14日-学习日志","slug":"2017年12月14日-学习日志","date":"2017-12-14T13:11:05.000Z","updated":"2018-11-21T13:17:36.336Z","comments":true,"path":"2017/12/14/2017年12月14日-学习日志/","link":"","permalink":"http://yoursite.com/2017/12/14/2017年12月14日-学习日志/","excerpt":"","text":"慢慢来不要急，你想要的都会有的 Js自调12!function ($) &#123; //code her&#125;(window.jQuery);高级的自调函数的一种写法(function ($) &#123; //code her&#125;)(window.jQuery) 普通自调函数的一种写法 括号使得里面的匿名函数变成函数表达式！的运算优先级低于括号朔所以可以达到相同的效果1var Name=function(parameters)&#123;//这里是块级作用域&#125;;Name();//调用匿名函数 函数表达式是在运行中以引用的方式赋值给一个变量的，如上面的函数创建的方式。而这里函数表达式和函数声明是不一样的，函数声明的通常形式如下：1function Name(parameters)&#123; //code here&#125; 函数声明会在程序刚开始运行的时候会被提升（所以可以在执行之后声明），但是并不执行，直到被调用的时候再执行。 Js()表达式总结：()运算，返回的是括号里面的最后一个参数","categories":[],"tags":[]},{"title":"hello","slug":"hello","date":"2017-11-09T02:41:53.000Z","updated":"2018-11-20T16:08:30.888Z","comments":true,"path":"2017/11/09/hello/","link":"","permalink":"http://yoursite.com/2017/11/09/hello/","excerpt":"","text":"这是一个标题这是一个指令System.print.out(\"Hello Hexo!\") Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque hendrerit lacus ut purus iaculis feugiat. Sed nec tempor elit, quis aliquam neque. Curabitur sed diam eget dolor fermentum semper at eu lorem. Do not just seek happiness for yourself. Seek happiness for all. Through kindness. Through mercy. David LevithanWide Awake NEW: DevDocs now comes with syntax highlighting. http://devdocs.io @DevDocstwitter.com/devdocs/status/356095192085962752 Every interaction is both precious and an opportunity to delight. Seth GodinWelcome to Island Marketing contentvvdafsadfasdf fasdfadfasdfasdf","categories":[{"name":"hello","slug":"hello","permalink":"http://yoursite.com/categories/hello/"}],"tags":[{"name":"hello","slug":"hello","permalink":"http://yoursite.com/tags/hello/"}]}]}